[
  {
    "title": "BBQ Pulled Pork Burger",
    "image": "img/Burger.jpg",
    "category": "dinner",
    "ingredients": [
      "2kg pork shoulder",
      "3 tablespoons olive oil",
      "2 tablespoons smoked paprika",
      "1 tablespoon ground cumin",
      "1 tablespoon brown sugar",
      "1 teaspoon ground mustard",
      "1 teaspoon cayenne pepper",
      "Salt and black pepper",
      "2 large onions, finely sliced",
      "4 cloves garlic, minced",
      "1 cup BBQ sauce",
      "2 tablespoons Worcestershire sauce",
      "1 tablespoon apple cider vinegar",
      "1 tablespoon Dijon mustard",
      "1/2 cup chicken stock or water",
      "Burger buns",
      "Butter for toasting buns"
    ],
    "steps": "Start by preparing your pork shoulder. Preheat your oven to 160°C (320°F). Pat the pork shoulder dry with paper towels to remove any excess moisture, then rub it generously with olive oil. In a small bowl, combine the smoked paprika, ground cumin, brown sugar, ground mustard, cayenne pepper, salt, and freshly ground black pepper. Massage this spice blend all over the pork, ensuring that every crevice is well-coated. The spices will form a crust that infuses the meat with flavour as it cooks. \n\nHeat a large, heavy-based pan (a cast iron skillet is perfect) over medium-high heat. Once hot, carefully place the pork shoulder in the pan and sear it on all sides. This step is essential—it caramelises the outside of the pork, locking in the juices and giving it a rich, golden-brown colour. Take your time here; you want each side of the pork to develop a deep, toasty crust. Once browned, transfer the pork to a large roasting tray, setting it aside for now. \n\nIn the same pan, add a little more olive oil if needed, then toss in the sliced onions. Sauté them slowly, stirring occasionally until they become soft, translucent, and start to caramelise, about 10-15 minutes. Once the onions are golden and sweet, add the minced garlic and sauté for another minute until fragrant. \n\nNow, pour in the BBQ sauce, Worcestershire sauce, Dijon mustard, apple cider vinegar, and chicken stock (or water). Stir everything together, scraping up any browned bits stuck to the bottom of the pan—that's where a lot of the flavour lies! Bring the mixture to a simmer, then pour it all over the pork shoulder in the roasting tray, making sure the pork is well-coated with the sauce. Cover the roasting tray tightly with foil, sealing in all the moisture to create a steamy environment for the pork to tenderise. \n\nPlace the tray in the preheated oven and roast for 3-4 hours, checking periodically. The slow cooking process is key to breaking down the pork's tough fibres, resulting in meat that’s incredibly tender and juicy. You’ll know it’s ready when the pork can be easily pulled apart with a fork. \n\nOnce your pork is beautifully cooked and tender, carefully remove it from the oven and allow it to rest for 15 minutes. This resting period helps the juices redistribute throughout the meat, ensuring every bite is succulent. Using two forks, shred the pork directly in the roasting tray, mixing it with the rich BBQ sauce that has gathered at the bottom. If the sauce is too thick, add a splash of water or chicken stock to loosen it, making sure each piece of pork is coated in that smoky, tangy goodness. \n\nNow it's time to prepare your burger buns! Slice the buns in half and butter the cut sides. Heat a pan or griddle over medium heat and toast the buns, butter-side down, until golden and crispy. This not only adds flavour but also helps prevent the buns from becoming soggy when filled with the juicy pork. \n\nTo assemble your burgers, start by layering a generous portion of the pulled pork onto the bottom half of each bun. If you’re feeling indulgent, add a slice of sharp cheddar cheese on top of the pork for a creamy contrast. Next, pile on a handful of crunchy coleslaw, which adds freshness and a nice contrast to the smoky richness of the pork. Finally, add a few slices of pickles and jalapeños (if you like a bit of heat) before placing the top half of the bun in place. \n\nServe the BBQ Pulled Pork Burgers with extra BBQ sauce on the side and a side of crispy fries or onion rings for the ultimate BBQ feast. With each bite, you'll get a perfect balance of smoky, tangy, and savoury flavours, all wrapped up in a soft, buttery bun. Enjoy this messy, delicious masterpiece with friends or family at your next gathering! ",
    "rating": 5,
    "rating_count": 230
  },
  {
    "title": "Authentic Italian Pizza",
    "image": "img/Pizza.jpg",
    "category": "dinner",
    "ingredients": [
      "500g all-purpose flour",
      "325ml warm water",
      "1 packet active dry yeast",
      "1 teaspoon sugar",
      "2 teaspoons salt",
      "2 tablespoons olive oil",
      "200g Sliced mozzarella cheese",
      "150g tomato sauce",
      "Fresh basil leaves",
      "1 teaspoon oregano",
      "1 teaspoon garlic powder",
      "100g sliced pepperoni",
      "100Kg Pinaepple slices",
      "100g sliced mushrooms"
    ],
    "steps": "Making authentic Italian pizza is a delightful and rewarding experience, perfect for bringing a touch of Italy into your home. Begin by combining the warm water and sugar in a small bowl, then sprinkle the yeast on top and let it sit for about 10 minutes until frothy. In a large mixing bowl, combine the flour and salt. Create a well in the centre and pour in the yeast mixture along with the olive oil. Stir until a dough forms. Knead the dough on a floured surface for about 10 minutes until smooth and elastic. Place the dough in a lightly oiled bowl, cover with a damp cloth, and let it rise in a warm place for about 1 hour, or until it has doubled in size. \n\nOnce the dough has risen, preheat your oven to its highest setting, ideally around 250°C (480°F). Punch down the dough and divide it into two equal parts. Roll each part into a ball and let them rest for another 10 minutes. On a floured surface, roll out one of the dough balls into a thin circle, about 30cm (12 inches) in diameter. Transfer the dough to a baking sheet or pizza stone. Spread a thin layer of tomato sauce over the dough, leaving a small border around the edges. Sprinkle the oregano and garlic powder evenly over the sauce. Arrange the mozzarella cheese slices on top, followed by any additional toppings you desire, such as pepperoni or fresh basil leaves. \n\nBake the pizza in the preheated oven for about 10-12 minutes, or until the crust is beautifully golden and the cheese is bubbling and lightly browned. If you're using a pizza stone, the baking time might be a little shorter due to the even distribution of heat. Keep an eye on it to avoid burning. Once baked to perfection, carefully remove the pizza from the oven and allow it to cool for a minute or two to let the cheese set slightly, making it easier to slice. \n\nBefore serving, you can add an extra touch of flavour by garnishing the pizza with fresh basil leaves, a drizzle of high-quality olive oil, or a sprinkle of chilli flakes for a bit of heat. For a truly authentic Italian experience, pair your pizza with a simple green salad and a glass of your favourite wine. Repeat the rolling, topping, and baking process with the second dough ball. \n\nNow, enjoy your delicious homemade authentic Italian pizza, savouring each bite of the crispy crust, rich tomato sauce, and melted mozzarella cheese! Buon appetito! ",
    "rating": 4,
    "rating_count": 170
  },
  {
    "title": "Roast Turkey",
    "image": "img/Turkey.jpg",
    "category": "dinner",
    "ingredients": [
      "5kg whole turkey",
      "4 tablespoons olive oil",
      "2 tablespoons butter",
      "2 teaspoons dried thyme",
      "2 teaspoons dried rosemary",
      "1 tablespoon garlic powder",
      "1 tablespoon onion powder",
      "1 teaspoon paprika",
      "Salt and black pepper",
      "2 onions, quartered",
      "4 carrots, roughly chopped",
      "3 celery stalks, roughly chopped",
      "1 lemon, halved",
      "1 bunch fresh parsley",
      "500ml chicken stock",
      "250ml white wine",
      "2 tablespoons flour (for gravy)"
    ],
    "steps": "Begin your roast turkey adventure by preparing the bird for its flavour journey. Preheat your oven to 180°C (350°F). Ensure your turkey is fully thawed, then pat it dry with paper towels inside and out. This step is key for ensuring that deliciously crisp skin. \n\nIn a small bowl, mix together olive oil, melted butter, thyme, rosemary, garlic powder, onion powder, paprika, salt, and black pepper to create a flavour-packed rub. Carefully lift the skin over the turkey breast and massage half of the rub directly onto the meat under the skin. This will infuse the turkey with flavour from within, ensuring each bite is juicy and aromatic. Now, rub the remaining mixture all over the turkey's skin, paying special attention to the wings and legs. Let this sit for a few minutes to let the flavours meld. \n\nStuff the turkey cavity with a mix of quartered onions, chopped carrots, celery, halved lemon, and a handful of fresh parsley. These aromatic vegetables will steam inside the bird as it roasts, adding moisture and enhancing the flavour of the meat. If you're feeling adventurous, you can also add a few garlic cloves or sprigs of fresh thyme or rosemary. Tie the turkey legs together with kitchen twine to ensure even cooking, and tuck the wings under the bird to prevent them from burning. \n\nNext, place the turkey breast-side up in a large roasting pan, making sure it’s sitting on a bed of the remaining chopped onions, carrots, and celery. This vegetable base will not only prevent the turkey from sticking to the pan but will also contribute to the rich, savoury gravy you'll make later. Pour the chicken stock and white wine into the bottom of the pan. This will create steam during the roasting process, keeping the turkey moist and adding depth to your gravy. \n\nCover the turkey loosely with aluminium foil to prevent the skin from browning too quickly. Place the turkey in the preheated oven and roast for about 3 to 4 hours, depending on the size of your bird (around 20 minutes per 500g). Every 30-40 minutes, baste the turkey with the juices that collect at the bottom of the pan. Basting helps the skin to crisp up and ensures the turkey stays moist. If you notice the skin browning too quickly, keep the foil on a little longer before removing it to let the skin crisp during the final hour of cooking. \n\nAbout 30 minutes before the turkey is done, remove the foil to let the skin turn a gorgeous golden brown. The turkey is ready when the internal temperature reaches 75°C (165°F) in the thickest part of the thigh. To check, insert a meat thermometer into the thigh without touching the bone. Once it’s cooked to perfection, remove the turkey from the oven and allow it to rest for 20-30 minutes. Resting is crucial as it allows the juices to redistribute throughout the meat, making each slice moist and flavourful. \n\nWhile the turkey rests, you can prepare the gravy. Pour the drippings from the roasting pan into a saucepan, skimming off excess fat. Place the roasting pan over medium heat, sprinkle in the flour, and whisk constantly, scraping up the delicious browned bits from the bottom of the pan. Slowly add the reserved drippings back into the pan along with some extra chicken stock, stirring until the gravy thickens to your liking. Season with salt and pepper to taste. \n\nOnce your turkey has rested, carve it carefully, starting with the legs and thighs before moving to the breast. Serve with a generous drizzle of the homemade gravy, along with your favourite sides like roasted vegetables or mashed potatoes. Each bite will be a perfect balance of crispy skin, tender meat, and savoury flavours. Happy feasting! ",
    "rating": 5,
    "rating_count": 245
  },
  {
    "title": "Authentic Pesto",
    "image": "img/pesto.jpg",
    "category": "lunch",
    "ingredients": [
      "100g fresh basil leaves",
      "50g pine nuts",
      "50g Parmesan cheese, grated",
      "2 garlic cloves",
      "120ml extra virgin olive oil",
      "1 tablespoon lemon juice",
      "Salt and black pepper",
      "30g Pecorino Romano cheese, grated (optional)"
    ],
    "steps": "To make an authentic, vibrant pesto, the secret lies in fresh ingredients and the love you pour into each step. Begin by washing and gently patting dry your fresh basil leaves. This simple herb is the heart of your pesto, bringing the bright, aromatic flavour that sets it apart from anything store-bought. Next, lightly toast the pine nuts in a dry pan over medium heat for a few minutes, stirring frequently to ensure they don’t burn. Toasting enhances the nutty flavour and adds a rich dimension to your pesto, making every bite irresistible. \n\nNow, let's get to the fun part – using a mortar and pestle, the traditional way to make pesto! Begin by crushing the garlic cloves with a pinch of salt until you form a smooth paste. The salt not only helps break down the garlic but also balances the intense flavours later on. Add in the basil leaves a handful at a time, grinding them against the sides of the mortar in a circular motion. This slow, methodical grinding releases the essential oils in the basil, intensifying the aroma and flavour. As the basil breaks down, you’ll notice the beautiful green paste forming. Take your time – this process is all about patience and love for the ingredients. \n\nOnce your basil and garlic mixture is a fragrant, green paste, add the toasted pine nuts. Crush them gently into the mixture, giving the pesto a slightly chunky texture. If you're feeling adventurous, you can add some grated Pecorino Romano at this stage for extra sharpness, but Parmesan will do just fine on its own. Now, gradually incorporate the grated Parmesan cheese, continuing to grind and mix until everything is well combined. Parmesan adds that distinctive salty, umami flavour that takes the pesto to another level. \n\nIt’s time to add the olive oil, and here’s where your pesto really starts to come together. Slowly drizzle the extra virgin olive oil into the mortar while stirring constantly. You want the oil to emulsify with the other ingredients, creating a smooth, luxurious pesto. Be sure to use high-quality extra virgin olive oil for its rich, fruity flavour – this is a key component of authentic pesto. Add lemon juice to brighten the flavour, balancing the richness of the cheese and pine nuts. \n\nTaste your pesto and season it with salt and freshly ground black pepper to your liking. If you prefer a thinner pesto, feel free to add a little more olive oil until you reach your desired consistency. Some people like their pesto thicker, perfect for spreading on bread, while others prefer it a bit more liquid for tossing with pasta. Either way, your pesto is bursting with fresh, vibrant flavours. \n\nIf you don’t have a mortar and pestle, you can make pesto in a food processor. Just be sure to pulse the ingredients rather than blend them at high speed – the heat from over-processing can cause the basil to oxidise and turn bitter. \n\nYour authentic pesto is now ready! Toss it with freshly cooked pasta, spread it on sandwiches, or even drizzle it over grilled vegetables or meats. Its versatility and fresh, herby taste will elevate any dish. If you have leftovers, store them in an airtight container with a thin layer of olive oil on top to prevent browning. Buon appetito! ",
    "rating": 4,
    "rating_count": 150
  },
  {
    "title": "Korean Fried Chicken",
    "image": "img/popcorn.jpg",
    "category": "lunch",
    "ingredients": [
      "1kg chicken wings or drumettes",
      "120g cornflour",
      "1 teaspoon baking powder",
      "1 teaspoon salt",
      "1/2 teaspoon black pepper",
      "1/2 teaspoon garlic powder",
      "Vegetable oil for frying",
      "2 tablespoons soy sauce",
      "2 tablespoons gochujang (Korean chilli paste)",
      "2 tablespoons rice vinegar",
      "3 tablespoons honey",
      "1 tablespoon sesame oil",
      "2 garlic cloves, minced",
      "1 tablespoon ginger, minced",
      "1 tablespoon sesame seeds",
      "Spring onions for garnish"
    ],
    "steps": "To make crispy, flavour-packed Korean Fried Chicken, the secret lies in achieving the perfect crunch while coating the chicken in a sticky, spicy sauce that will keep you coming back for more. Begin by prepping your chicken wings or drumettes. Pat them dry with paper towels to remove any excess moisture – this step is crucial for getting a crispy exterior when frying. Season the chicken with salt, pepper, and garlic powder, ensuring every piece is well coated. \n\nIn a large bowl, mix the cornflour and baking powder. The baking powder is key here as it helps to make the coating light and extra crispy. Toss the chicken in this dry mixture until evenly coated. Let the chicken sit in the cornflour mixture for about 10-15 minutes, allowing the coating to adhere to the surface. This ensures that each bite will be crunchy and satisfying. \n\nNow, it’s time to fry! Heat vegetable oil in a deep pan or fryer to about 180°C (350°F). Carefully lower the chicken pieces into the hot oil, working in batches to avoid overcrowding the pan. Fry the chicken for 6-8 minutes until it is golden and crispy. For the ultimate crunch, double fry the chicken: after the first fry, remove the chicken and let it rest for a few minutes. Then return it to the hot oil for a second fry, which will give it that signature Korean fried chicken crispiness. \n\nWhile the chicken is frying, let’s prepare the star of the dish – the sweet and spicy sauce. In a small saucepan, heat the sesame oil over medium heat. Add the minced garlic and ginger, sautéing until fragrant, about 1-2 minutes. Next, stir in the gochujang, soy sauce, rice vinegar, and honey. Simmer this mixture for a few minutes, letting the flavours meld together and the sauce thicken slightly. The combination of the spicy gochujang, salty soy sauce, and sweet honey creates the perfect balance of flavours that defines Korean fried chicken. \n\nOnce the chicken has finished its second fry, immediately toss the hot, crispy chicken in the sauce, ensuring each piece is generously coated. The sauce will cling to the chicken’s crispy exterior without making it soggy, thanks to the double frying technique. Garnish with toasted sesame seeds and freshly sliced spring onions for an extra pop of flavour and crunch. \n\nYour Korean Fried Chicken is now ready to serve! The perfect combination of crunch and sticky, spicy sauce will have everyone reaching for more. Serve it with a side of pickled radish or kimchi to cut through the richness, and don’t forget a cold drink to cool off the heat. Whether enjoyed as a snack, appetiser, or main course, this Korean Fried Chicken will quickly become a favourite! Enjoy! ",
    "rating": 5,
    "rating_count": 210
  },
  {
    "title": "Churros with Dip",
    "image": "img/Churro.jpg",
    "category": "dessert",
    "ingredients": [
      "1 cup water",
      "2 tablespoons sugar",
      "1/2 teaspoon salt",
      "2 tablespoons vegetable oil",
      "1 cup all-purpose flour",
      "Oil for frying",
      "1/2 cup sugar (for coating)",
      "1 teaspoon cinnamon",
      "Chocolate sauce or caramel for dipping"
    ],
    "steps": "In a saucepan, bring water, sugar, salt, and vegetable oil to a boil. Remove from heat and stir in the flour until the mixture forms a ball. \n\nHeat oil in a deep pan to 190°C (375°F). Spoon the dough into a piping bag with a star-shaped tip. Pipe 10cm (4-inch) strips of dough into the hot oil and fry until golden and crispy, about 2 minutes on each side. \n\nDrain on paper towels and toss the churros in a mixture of sugar and cinnamon. Serve with warm chocolate or caramel sauce for dipping. These crispy, sweet churros are a delightful treat for any occasion! ",
    "rating": 4,
    "rating_count": 140
  },
  {
    "title": "Texas BBQ Ribs",
    "image": "img/steak.jpg",
    "category": "dinner",
    "ingredients": [
      "1 rack pork ribs",
      "1/4 cup brown sugar",
      "1 tablespoon smoked paprika",
      "1 teaspoon garlic powder",
      "1 teaspoon onion powder",
      "1 teaspoon ground cumin",
      "Salt and pepper to taste",
      "1 cup BBQ sauce"
    ],
    "steps": "Preheat your oven to 150°C (300°F). Combine the brown sugar, paprika, garlic powder, onion powder, cumin, salt, and pepper to make a dry rub. Rub this mixture all over the ribs. \n\nWrap the ribs in foil and place them on a baking tray. Bake for 2.5 to 3 hours until the meat is tender and pulls away from the bone. \n\nRemove the ribs from the oven, brush them generously with BBQ sauce, and finish them on a grill or under a hot broiler for 5-10 minutes, until the sauce is caramelised and sticky. Serve with extra sauce and enjoy the rich, smoky flavours of Texas BBQ! ",
    "rating": 3,
    "rating_count": 200
  },
  {
    "title": "Spaghetti Bolognese",
    "image": "img/pancake.jpg",
    "category": "breakfast",
    "ingredients": [
      "500g minced beef",
      "1 onion, finely chopped",
      "2 cloves garlic, minced",
      "1 carrot, diced",
      "1 celery stalk, diced",
      "1 can chopped tomatoes",
      "2 tablespoons tomato paste",
      "1/2 cup red wine",
      "1 teaspoon dried oregano",
      "Salt and pepper to taste",
      "Spaghetti, for serving",
      "Grated Parmesan, for serving"
    ],
    "steps": "In a large pan, sauté the onion, garlic, carrot, and celery in olive oil until softened. Add the minced beef and cook until browned. \n\nStir in the tomato paste, chopped tomatoes, red wine, and oregano. Simmer the sauce on low heat for at least 45 minutes to allow the flavours to develop. Season with salt and pepper. \n\nMeanwhile, cook the spaghetti according to the package instructions. Serve the rich Bolognese sauce over the spaghetti, topped with freshly grated Parmesan. Enjoy this comforting Italian classic with a side of garlic bread! ",
    "rating": 2,
    "rating_count": 137
  },
  {
    "title": "Slow Cooked Beef Stew",
    "image": "img/Stew.jpg",
    "category": "dinner",
    "ingredients": [
      "1kg beef chuck, cubed",
      "2 carrots, chopped",
      "2 potatoes, chopped",
      "1 onion, chopped",
      "2 cloves garlic, minced",
      "1 cup beef broth",
      "1 tablespoon tomato paste",
      "1 tablespoon Worcestershire sauce",
      "1 teaspoon dried thyme",
      "Salt and pepper to taste"
    ],
    "steps": "In a large pot, brown the beef cubes on all sides. Remove from the pot and set aside. In the same pot, sauté the onion and garlic until soft. Add the carrots and potatoes and cook for a few minutes. \n\nReturn the beef to the pot and add the beef broth, tomato paste, Worcestershire sauce, thyme, salt, and pepper. Bring to a simmer. \n\nCover the pot and cook on low heat for 2-3 hours, until the beef is tender and the vegetables are cooked through. Serve this hearty beef stew with crusty bread for a warming meal on a cold day! ",
    "rating": 4,
    "rating_count": 18
  },
  {
    "title": "Iced Bubble Tea",
    "image": "img/drink.jpg",
    "category": "drinks",
    "ingredients": [
      "1/2 cup tapioca pearls",
      "1 cup brewed black tea, chilled",
      "1/4 cup milk",
      "1 tablespoon sugar",
      "Ice cubes"
    ],
    "steps": "Cook the tapioca pearls according to the package instructions. Drain and rinse under cold water. \n\nIn a glass, mix the chilled black tea, milk, and sugar until the sugar dissolves. Add the cooked tapioca pearls and stir. \n\nFill the glass with ice cubes and enjoy your refreshing iced bubble tea, perfect for a hot day! Feel free to customise with different flavours or fruit additions for a fun twist! ",
    "rating": 5,
    "rating_count": 68
  },
  {
    "title": "Test recipe",
    "image": "https://frommybowl.com/wp-content/uploads/2018/07/Watermelon_Slushie_Vegan_GlutenFree_4Ingredients_FromMyBowl-6.jpg",
    "ingredients": [
      "4 big guys"
    ],
    "steps": "test",
    "category": "drinks",
    "rating": "1",
    "rating_count": 1
  }
]
